pensum-toolbox/controllers/SiteController.php

SELECT * FROM `curso` WHERE codigo = '101'
---
    public function actionAprobarCurso($codigo_curso){
        // ACA SE DEBE OBTENER EL CARNET DE USUARIO LOGUEADO
        $carnet_usuario = 209900909; // USUARIO DE PRUEBAS

        $curso_row = Curso::find()->where('codigo = :codigo', [':codigo' => $codigo_curso])->one();

SELECT * FROM `curso` WHERE codigo = '101'
---
    public function actionNoAprobarCurso($codigo_curso){
        // ACA SE DEBE OBTENER EL CARNET DE USUARIO LOGUEADO
        $carnet_usuario = 209900909; // USUARIO DE PRUEBAS

        $curso_row = Curso::find()->where('codigo = :codigo', [':codigo' => $codigo_curso])->one();

SELECT * FROM `curso` WHERE codigo = '770'
---
    public function actionRetraUnica($codigo_curso){
        // ACA SE DEBE OBTENER EL CARNET DE USUARIO LOGUEADO
        $carnet_usuario = 209900909; // USUARIO DE PRUEBAS

        $curso_row = Curso::find()->where('codigo = :codigo', [':codigo' => $codigo_curso])->one();