pensum-toolbox/utilities/Dashboard.php

SELECT * FROM `area`
---
    public static function get_cursos($carnet_usuario){
        $result = [];
        $area_rows = Area::find()->all();

SELECT `usuario_curso`.* FROM `usuario_curso` LEFT JOIN `curso` ON `usuario_curso`.`curso` = `curso`.`codigo` WHERE (usuario = 209900909) AND (curso.area = '1')
---
    public static function get_cursos_por_area($carnet_usuario, $id_area){
        $query = UsuarioCurso::find()->joinWith('curso0','estadoCurso');
        $query = $query->where('usuario = :usuario', [':usuario' => $carnet_usuario]);
        $query = $query->andWhere('curso.area = :area', [':area' => $id_area]);
        $query = $query->all();