pensum-toolbox/utilities/OperacionesCurso.php

SELECT * FROM `usuario_curso` WHERE (curso = '101') AND (usuario = 209900909)
UPDATE `usuario_curso` SET `estado_curso`='2' WHERE (`usuario`='209900909') AND (`curso`='101')
---
    public static function marcar_como_aprobado($codigo_curso, $carnet_usuario){
        try{
            if(OperacionesCurso::validar_prerrequisitos($codigo_curso, $carnet_usuario)){
                $usuario_curso_row = UsuarioCurso::find()->where('curso = :curso', [':curso' => $codigo_curso])->andWhere('usuario = :usuario', [':usuario' => $carnet_usuario])->one();
                $usuario_curso_row->estado_curso = 2;
                $usuario_curso_row->save();

SELECT * FROM `prerrequisito` WHERE post = '101'
SELECT COUNT(*) FROM `usuario_curso` WHERE (curso = '103') AND (estado_curso = 2)
---
    public static function validar_prerrequisitos($codigo_curso, $carnet_usuario){
        $prerrequisito_rows = Prerrequisito::find()->where('post = :post', [':post' => $codigo_curso])->all();
        foreach($prerrequisito_rows as $prerrequisito_row){
            $usuario_curso_count = UsuarioCurso::find()->where('curso = :curso',[':curso' => $prerrequisito_row->pre])->andWhere('estado_curso = 2')->count();

SELECT * FROM `usuario_curso` WHERE (curso = '101') AND (usuario = 209900909)
UPDATE `usuario_curso` SET `estado_curso`='1' WHERE (`usuario`='209900909') AND (`curso`='101')
---
    public static function marcar_como_no_aprobado($codigo_curso, $carnet_usuario){
        try{
            $usuario_curso_row = UsuarioCurso::find()->where('curso = :curso', [':curso' => $codigo_curso])->andWhere('usuario = :usuario', [':usuario' => $carnet_usuario])->one();
            $usuario_curso_row->estado_curso = 1;
            $usuario_curso_row->save();