pensum-toolbox/utilities/OperacionesArea.php

    public static function get_total_cursos_por_area($id_area){
        $query = Curso::find()->where('area = :area', [':area' => $id_area]);
        return $query->count();
---
SELECT COUNT(*) FROM `curso` WHERE area = '1'

    public static function get_cursos_aprobados_por_area($id_area, $carnet_usuario){
        $query = UsuarioCurso::find()->joinWith('curso0');
        $query = $query->where('usuario = :usuario', [':usuario' => $carnet_usuario]);
        $query = $query->andWhere('curso.area = :area', [':area' => $id_area]);
        $query = $query->andWhere('usuario_curso.estado_curso = 2');
        return $query->count();
---
SELECT COUNT(*) FROM `usuario_curso` LEFT JOIN `curso` ON `usuario_curso`.`curso` = `curso`.`codigo` WHERE (usuario = 209900909) AND (curso.area = '1') AND (usuario_curso.estado_curso = 2)