pensum-toolbox/utilities/OperacionesCreditos.php

    public static function get_total_creditos_usuario($carnet_usuario){
        $usuario_curso_rows = UsuarioCurso::find()->where('usuario = :usuario', [':usuario' => $carnet_usuario])->andWhere('estado_curso = 2')->all();
---
SELECT * FROM `usuario_curso` WHERE (usuario = 209900909) AND (estado_curso = 2)

    public static function get_total_creditosextra_usuario($carnet_usuario){
      $usuario_actividad_rows = UsuarioCurso::find()->where('usuario = :usuario', [':usuario' => $carnet_usuario])->andWhere('estado_curso = 2')->all();
---
SELECT * FROM `usuario_curso` WHERE (usuario = 209900909) AND (estado_curso = 2)